backend/controllers/ArticleController.php

SELECT * FROM `wx_article` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Article::findOne($id)) !== null) {