backend/controllers/UserController.php

    public function actionResetPassword($id = 0)
    {
        if (Yii::$app->user->isGuest) {
            $model = new LoginForm();
            return $this->render('login', [
                'model' => $model,
            ]);
        }

        $id = Yii::$app->user->identity->role == 'admin' ? $id : Yii::$app->user->identity->id;
        $model = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`='11'