backend/modules/staff/controllers/StaffController.php

    public function actionDelete($id)
    {
        $model = $this->findModel($id);
        $user = Users::findOne($model->userid);
---
SELECT * FROM `user` WHERE `id`=0

    protected function findModel($id)
    {
        if (($model = Staff::findOne($id)) !== null) {
---
SELECT * FROM `user_staff` WHERE `id`='2'