backend/modules/service/controllers/FamilyController.php

SELECT * FROM `service_category` WHERE `id`=140
SELECT * FROM `service_category` WHERE ((`lft` < '5') AND (`rgt` > '8')) AND (`root`='4') ORDER BY `lft`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $categoryInfo = ServiceCategory::find()->where(['id'=>$model->category_id])->asArray()->one();
        $categoryPath = ServiceCategory::find()
            ->where(['<','lft',$categoryInfo['lft']])
            ->andWhere(['>','rgt',$categoryInfo['rgt']])
            ->andWhere(['root' => $categoryInfo['root']])
            ->orderBy('lft')
            ->indexBy('id')
            ->asArray()
            ->all();