backend/modules/service/controllers/ServiceController.php

SELECT `id`, `name` FROM `service_category`
---
    public function actionIndex()
    {
        $searchModel = new ServiceSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $category = ServiceCategory::find()->select(['id','name'])->asArray()->all();