backend/modules/service/controllers/ServiceCategoryController.php

SELECT * FROM `service_category` WHERE `level`=0
SELECT * FROM `service_category` WHERE `id`='4'
SELECT * FROM `service_category` WHERE (((`level`=1) AND (`root`='4')) AND (`lft` > '1')) AND (`rgt` < '72') ORDER BY `lft`
---
  	public function actionGetNode($id) {
  	    if(!$id)
        {
            $categoryPath = ServiceCategory::find()->where(['level' => 0])->indexBy('id')->asArray()->all();
        }
        else
        {
            $nodeInfo = ServiceCategory::find()->where(['id' => $id])->asArray()->one();
            $categoryPath = ServiceCategory::find()
                ->where(['level' => $nodeInfo['level'] + 1])
                ->andWhere(['root' => $nodeInfo['root']])
                ->andWhere(['>', 'lft', $nodeInfo['lft']])
                ->andWhere(['<', 'rgt', $nodeInfo['rgt']])
                ->orderBy('lft')
                ->indexBy('id')
                ->asArray()
                ->all();