backend/modules/product/controllers/ProductCategoryController.php

SELECT * FROM `product_category` WHERE `level`=0
SELECT * FROM `product_category` WHERE `id`='40'
SELECT * FROM `product_category` WHERE (((`level`=3) AND (`root`='4')) AND (`lft` > '3')) AND (`rgt` < '4') ORDER BY `lft`
---
  	public function actionGetNode($id) {
  	    if(!$id)
        {
            $categoryPath = ProductCategory::find()->where(['level' => 0])->indexBy('id')->asArray()->all();
        }
        else
        {
            $nodeInfo = ProductCategory::find()->where(['id' => $id])->asArray()->one();
            $categoryPath = ProductCategory::find()
                ->where(['level' => $nodeInfo['level'] + 1])
                ->andWhere(['root' => $nodeInfo['root']])
                ->andWhere(['>', 'lft', $nodeInfo['lft']])
                ->andWhere(['<', 'rgt', $nodeInfo['rgt']])
                ->orderBy('lft')
                ->indexBy('id')
                ->asArray()
                ->all();