common/models/User.php

    public static function findByUsername($username)
    {
        $user = static::findOne(['email' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='carl') AND (`status`='active')