api/controllers/SiteController.php

    public function actionIndex()
    {
        $activity = Events::find()->select(['id', 'title', 'info'])->where(['category_id' => '146'])->orderBy('id')->limit(3)->all();
---
SELECT `id`, `title`, `info` FROM `events` WHERE `category_id`='146' ORDER BY `id` LIMIT 3

    public function actionContact()
    {
        $model = WebCfg::find()->all();
---
SELECT * FROM `web_cfg` WHERE `id`=''