backend/components/CommonController.php

    public function getStaff()
    {
        $data = ['staff'=>null, 'shield'=>[]];
        if(Yii::$app->user->identity->type == 'staff')
        {
            $data['staff'] = Staff::find()->select(['id','position','category_id'])->where(['userid'=>Yii::$app->user->identity->id])->one();
---
SELECT `id`, `position`, `category_id` FROM `user_staff` WHERE `userid`=23