backend/modules/student/controllers/StudentController.php

SELECT * FROM `service_category` WHERE `id`=137
SELECT * FROM `service_category` WHERE ((`lft` < '4') AND (`rgt` > '13')) AND (`root`='4') ORDER BY `lft`
---
    public function actionCreate()
    {
        $model = new Student();
        $patriarch = new Patriarch();
        $model->sex = '男';

        $categoryInfo = ServiceCategory::find()->where(['id'=>137])->asArray()->one();
        $categoryPath = ServiceCategory::find()
            ->where(['<','lft',$categoryInfo['lft']])
            ->andWhere(['>','rgt',$categoryInfo['rgt']])
            ->andWhere(['root' => $categoryInfo['root']])
            ->orderBy('lft')
            ->indexBy('id')
            ->asArray()
            ->all();